Catalogs/ЗадачиПроектовСтруктура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>ЗадачиПроектовСтруктура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ЗадачиПроектов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Закрыта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продолжительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаннийСтарт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаннийФиниш</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПозднийСтарт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПозднийФиниш</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Резерв</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Суммарная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентВыполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСДР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЗадачи</Name>
					<Comment>Для загрузки из MSProject</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОграничения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОграниченияРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КритическийПуть</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРасчетаСрокаРаботы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРасчетаСрокаРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ресурсы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Мощность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифнаяСтавка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТарифныеСтавки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТипыРасчетаСрокаРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>ТипыРасчетаСрокаРабот</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоЗадачеПроекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вручную</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Автоматически</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыОграниченияРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ТипыОграниченияРабот</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КакМожноРаньше</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КакМожноПозже</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачалоНеПозднее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачалоНеРанее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОкончаниеНеПозднее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОкончаниеНеРанее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированноеНачало</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированноеОкончание</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ЗадачиПроектовСтруктура/Ext/ObjectModule.bsl
Процедура ПриЗаписи(Отказ)
	// проверка заполнения нужных полей
	Если ТипРасчетаСрокаРаботы = Перечисления.ТипыРасчетаСрокаРабот.Автоматически Тогда
		Если 	ТипОграничения = Перечисления.ТипыОграниченияРабот.НачалоНеПозднее
		или	 	ТипОграничения = Перечисления.ТипыОграниченияРабот.НачалоНеРанее
		или	 	ТипОграничения = Перечисления.ТипыОграниченияРабот.ФиксированноеНачало Тогда
			Если НЕ ЗначениеЗаполнено( РаннийСтарт ) Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Не заполнена дата начала работы!";
				Сообщение.Сообщить();
				Отказ = Истина;
				Возврат;
			КонецЕсли;
			
		ИначеЕсли	ТипОграничения = Перечисления.ТипыОграниченияРабот.ОкончаниеНеПозднее
		или			ТипОграничения = Перечисления.ТипыОграниченияРабот.ОкончаниеНеРанее
		или			ТипОграничения = Перечисления.ТипыОграниченияРабот.ФиксированноеОкончание Тогда
			Если НЕ ЗначениеЗаполнено( ПозднийФиниш ) Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Не заполнена дата окончания работы!";
				Сообщение.Сообщить();
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		
		
		КонецЕсли;
	КонецЕсли;
	
	// если работа стала не суммарная, то это не затрагивает другие работы
	// т.к. не суммарной может самостоятельно новая работа
	// или при изменении других работ
	Если ЗначениеЗаполнено( Ссылка.Родитель ) Тогда
		Если УП_РаботыСервер.РазрешеноСделатьРаботуСуммарной( Ссылка.Родитель ) Тогда
			
			РодительОбъект = Ссылка.Родитель.ПолучитьОбъект();
			//ЗаблокироватьДанныеДляРедактирования(РодительОбъект.Ссылка);
			РодительОбъект.Суммарная	= Истина;
			РодительОбъект.Записать();
		Иначе
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Работа " + Ссылка.Родитель + Символы.ПС + 
							  "не может стать суммарной, т.к. используется в документах или связях работ";
			Сообщение.Сообщить();
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	// пересчет сроков работ
	//УП_РаботыСервер.РасчитатьСрокиРабот( Ссылка.Владелец );
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	// родитель может стать не суммарной работой,
	// если текущая работа была последним потомком
	Если НЕ УП_РаботыСервер.ИзменилиОсиротевшегоРодителя( Ссылка ) Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ТипРасчетаСрокаРаботы <> Перечисления.ТипыРасчетаСрокаРабот.Автоматически Тогда
		ПроверяемыеРеквизиты.Удалить( ПроверяемыеРеквизиты.Найти( "ТипОграничения"));
	КонецЕсли;
	// Вставить содержимое обработчика.
КонецПроцедуры
